tobiaslenz1988/OilLevelTempSensor_GC9A01_3_0_ESP32_S3/uds_statemachine_common.cpp
            /* 0x22 0x07 0x01 */
            /* get Oillevel compare values for OldSensor*/
            if ((receive_BT_Array[1] == 0x07) && (receive_BT_Array[2] == 0x01)) {
              uint8_t i = 0;
              uint8_t tempvar;
              uint8_t sizeOfArr = sizeof(OldOilLevelCompValues) / sizeof(OldOilLevelCompValues[0]);
              uint8_t data[3+(sizeOfArr*2)];
              data[0] = posResponse;
              data[1] = 0x07;
              data[2] = 0x01;
              for (i = 0; i < (sizeOfArr*2; i+2) 
              {
                /* As example testval =         500 == 0x01F4    */
                /* BUS_output((uint8_t*)testval >> 8);         -> 0x01 */
                /* BUS_output((uint8_t*)testval & 0xFF);       -> 0xF4 */
                data[3+i] = (OldOilLevelCompValues[i] >> 8);
                //BUS_output((uint8_t*)tempvar);
                data[4+i] = (OldOilLevelCompValues[i] & 0xFF);
                //BUS_output((uint8_t*)tempvar);
              }
              BUS_output(data, 3+(sizeOfArr*2);


            } else
            /* 0x22 0x07 0x02 */
            /* tbd */
            if ((receive_BT_Array[1] == 0x07) && (receive_BT_Array[2] == 0x02)) {
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x07;
              data[2] = 0x02;
              BUS_output(data, 3);

            } else

            /* 0x22 0x07 0x03 */
            /* tbd */
            if ((receive_BT_Array[1] == 0x07) && (receive_BT_Array[2] == 0x03)) {
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x07;
              data[2] = 0x03;
              BUS_output(data, 3);

            } else {

              uint8_t data[3];
              data[0] = 0x7F;
              data[1] = UDS_READ_DATA_BY_IDENTIFIER;
              data[2] = UDS_NRC_requestOutOfRange;
              BUS_output(data, 3);
            }
      } else

        /*Command to write something*/
        if (receive_BT_Array[0] == UDS_WRITE_DATA_BY_IDENTIFIER) {
        uint8_t posResponse = (UDS_WRITE_DATA_BY_IDENTIFIER + 0x40);


          /* 0x2E 0xf1 0x90 */
          /* set Name of central chip */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x90)) 
          {
            uint8_t i;
            String tempStr;
            HWModuleName = { '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-' };
            uint8_t length_of_name = receive_BT_Array[3];
            for (i = 0; i < length_of_name; i++) 
            {
              tempStr.concat((char)receive_BT_Array[4 + i]);
              HWModuleName[i] = receive_BT_Array[4 + i];
            }

            preferences.begin(EEPROMNameSpace, false);
            preferences.putString("HWModuleName", tempStr);
            preferences.end();
            uint8_t data[3];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x90;
            BUS_output(data, 3);
          } else
          /* 0x2E 0xf1 0x91 */
          /* set VWPartNumber of OilTempSensor */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x91)) {
            uint8_t i;
            String tempStr;
            oemPartNumberOilTempSensor = DEFAULT_OEM_PARTNUMBER_OIL_TEMPSENSOR;
            uint8_t length_of_name = receive_BT_Array[3];
            for (i = 0; i < length_of_name; i++) {
              //Modulename[i] =  (char) receive_BT_Array[4+i];
              tempStr.concat((char)receive_BT_Array[4 + i]);
              oemPartNumberOilTempSensor[i] = receive_BT_Array[4 + i];
            }

            preferences.begin(EEPROMNameSpace, false);
            preferences.putString("PartNumberOilTempSensor", tempStr);
            preferences.end();


            uint8_t data[3];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x91;
            BUS_output(data, 3);
          } else

          /* 0x2E 0xf1 0x92 */
          /* set VWPartNumber of WaterTempSensor */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x92)) {
            uint8_t i;
            String tempStr;
            oemPartNumberWaterTempSensor = DEFAULT_OEM_PARTNUMBER_WATER_TEMPSENSOR;
            uint8_t length_of_name = receive_BT_Array[3];
            for (i = 0; i < length_of_name; i++) 
            {
              tempStr.concat((char)receive_BT_Array[4 + i]);
              oemPartNumberWaterTempSensor[i] = receive_BT_Array[4 + i];
            }

            preferences.begin(EEPROMNameSpace, false);
            preferences.putString("PartNumberWaterTempSensor", tempStr);
            preferences.end();

            uint8_t data[3];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x92;
            BUS_output(data, 3);
          } else

          /* 0x2E 0xf1 0x93 */
          /* set SupplierPartNumber of OilTempSensor */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x93)) {
            uint8_t i;
            String tempStr;
            supplierPartNumberOilTempSensor = DEFAULT_SUPPLIER_PARTNUMBER_OIL_TEMPSENSOR;
            uint8_t length_of_name = receive_BT_Array[3];
            for (i = 0; i < length_of_name; i++) 
            {
              tempStr.concat((char)receive_BT_Array[4 + i]);
              supplierPartNumberOilTempSensor[i] = receive_BT_Array[4 + i];
            }

              preferences.begin(EEPROMNameSpace, false);
              preferences.putString("supplierPartNumberOilTempSensor", tempStr);
              preferences.end();

              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0xF1;
              data[2] = 0x93;
               BUS_output(data, 3);
          } else
          /* 0x2E 0xf1 0x94 */
          /* set SupplierPartNumber of Water Tempsensor */
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x94)) {
            uint8_t i;
            String tempStr;
            supplierPartNumberWaterTempSensor = DEFAULT_SUPPLIER_PARTNUMBER_WATER_TEMPSENSOR;
            uint8_t length_of_name = receive_BT_Array[3];
            for (i = 0; i < length_of_name; i++) 
            {
              tempStr.concat((char)receive_BT_Array[4 + i]);
              supplierPartNumberWaterTempSensor[i] = receive_BT_Array[4 + i];
            }

            preferences.begin(EEPROMNameSpace, false);
            preferences.putString("supplierPartNumberWaterTempSensor", tempStr);
            preferences.end();
            uint8_t data[3];
            data[0] = posResponse;
            data[1] = 0xF1;
            data[2] = 0x94;
            BUS_output(data, 3);
          } else
          /* This part should change the name of the BT Module*/
          /* 0x2E 0xF1 0x97 0x?? 0x!!  0x!! 0x!! 0x!!......*/
          if ((receive_BT_Array[1] == 0xF1) && (receive_BT_Array[2] == 0x97)) 
          {
            uint8_t length_of_name = receive_BT_Array[3];
            if ((0 < length_of_name) && (length_of_name <= 20)) {
              uint8_t i;
              String tempStr;
              Modulename = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
              for (i = 0; i < length_of_name; i++) 
              {
                tempStr.concat((char)receive_BT_Array[4 + i]);
                Modulename[i] = receive_BT_Array[4 + i];
              }

              preferences.begin(EEPROMNameSpace, false);
              preferences.putString("Modulename", tempStr);
              preferences.end();
              //SerialBT.begin(tempStr);
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0xF1;
              data[2] = 0x97;
              BUS_output(data, 3);
            } else {
              uint8_t data[3];
              data[0] = 0x7F;
              data[1] = UDS_WRITE_DATA_BY_IDENTIFIER;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            }
          } else

