tobiaslenz1988/OilLevelTempSensor_GC9A01_3_0_ESP32_S3/uds_statemachine_common.cpp
              preferences.end();
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x07;
              data[2] = 0x01;
              BUS_output(data, 3);
            }
          } else
          /* tbd */
          /* 0x2E 0x07 0x02 0x!!......*/
          if ((receive_BT_Array[1] == 0x07) && (receive_BT_Array[2] == 0x02)) {
            uint8_t val = NULL;
            val = (uint8_t)receive_BT_Array[3];
            if (val == NULL) {
              uint8_t data[3];
              data[0] = 0x7f;
              data[1] = 0x2e;
              data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
              BUS_output(data, 3);
            } else {
              uint8_t data[3];
              data[0] = posResponse;
              data[1] = 0x07;
              data[2] = 0x02;
              BUS_output(data, 3);
            }
          } else
            /* tbd */
            /* 0x2E 0x07 0x03 0x!!......*/
            if ((receive_BT_Array[1] == 0x07) && (receive_BT_Array[2] == 0x03)) {
              uint8_t val = NULL;
              val = (uint8_t)receive_BT_Array[3];
              if (val == NULL) {
                uint8_t data[3];
                data[0] = 0x7f;
                data[1] = 0x2e;
                data[2] = UDS_NRC_incorrectMessageLengthOrInvalidFormat;
                BUS_output(data, 3);
              } else {
                uint8_t data[3];
                data[0] = posResponse;
                data[1] = 0x07;
                data[2] = 0x03;
                BUS_output(data, 3);
              }
            } else{
              uint8_t data[3];
              data[0] = 0x7f;
              data[1] = UDS_WRITE_DATA_BY_IDENTIFIER;
              data[2] = UDS_NRC_requestOutOfRange;
              BUS_output(data, 3);
            }
          } else

          /* Session Control */
          if (receive_BT_Array[0] == UDS_Session_Control) {
            if ((receive_BT_Array[1] == UDS_Session_Control_Default_Session) || (receive_BT_Array[1] == UDS_Session_Control_Extended_Session) || (receive_BT_Array[1] == UDS_Session_Control_Development_Session)) {
              if (session != receive_BT_Array[1]) {
                session = receive_BT_Array[1];
                preferences.begin(EEPROMNameSpace, false);
                preferences.putUChar("session", receive_BT_Array[1]);
                preferences.end();
              }
              uint8_t data[1];
              data[0] = 0x50;
              BUS_output(data, 1);
            } else {
            uint8_t data[3];
            data[0] = 0x7F;
            data[1] = UDS_Session_Control;
            data[2] = UDS_NRC_subFunctionNotSupported;
            BUS_output(data, 3);
          }
        } else

          if (receive_BT_Array[0] == UDS_ECU_Reset) {
            if (receive_BT_Array[1] == UDS_ECU_Reset_KeyOnOffReset) {
              uint8_t data[1];
              data[0] = 0x51;
              BUS_output(data, 1);
              delay(1500);
              ESP.restart();
            }
          }else{
            uint8_t data[3];
            data[0] = 0x7F;
            data[1] = receive_BT_Array[0];
            data[2] = UDS_NRC_serviceNotSupported;
            BUS_output(data, 3);
          }
          delete_BT_buffer();
        }
        NewData = false;
      }
